aemeltsev/STM32F0-FreeRTOS-CMSIS/src/main.c
#include "stm32f0xx.h"
#include "usart.h"
#include "util.h"
#include "button.h"

uint8_t ClockInitHSI48MHz(void);
uint8_t ClockInitHSI24MHz(void);
uint8_t ClockInitHSI8MHz(void);
uint8_t ClockInitHSE48MHz(void);
uint8_t ClockInitHSE32MHz(void);

volatile uint32_t timing_delay_count;
void delay_ms(uint32_t ms);

int main(void)
{
    // 1. First we need configure clock
    // ClockInitHSI8MHz();
    ClockInitHSI48MHz(); // функция настройки 48 МГц
    // 2. After call any ClockInit... functios need reinitialise SysTick
    // SysTick_Init(SystemCoreClock);

    // 3. Initialise other peripheral
    usart1_gpio_init(9600, 48000000);
    // init_button_led();
    // uint8_t button_state = 0;

    // OLED-код 
    i2c1_oled_init(); 
    oled_init(); 
    oled_clear(); 
    
    oled_setcursor (0, 0); // Левый крайний угол 
    oled_puts("Привет, STM32!"); 
    
    oled_setcursor (0, 2); // Третья строка (страница) 
    oled_puts("Температура: 25,5°C");

    //usart1_gpio_init();
    //configure_usart1(8, 16, 1, 2);

    //spi2_enable();
    //spi1_enable();
    
    //write(spi1_tx_buffer, WHO_AM_I, 1);
    //read(spi2_rx_buffer, WHO_AM_I, 1);
    //check_data(spi1_tx_buffer, spi2_rx_buffer, 1);

    //usart1_send(spi2_rx_buffer, sizeof(spi2_rx_buffer));
    RCC->AHBENR |= RCC_AHBENR_GPIOCEN;

    CLEAR_BIT(GPIOC->MODER, GPIO_MODER_MODER13);
    SET_BIT(GPIOC->MODER, GPIO_MODER_MODER13_0);
    CLEAR_BIT(GPIOC->OTYPER, GPIO_OTYPER_OT_13);
    CLEAR_BIT(GPIOC->OSPEEDR, GPIO_OSPEEDER_OSPEEDR13);
    SET_BIT(GPIOC->OSPEEDR, GPIO_OSPEEDER_OSPEEDR13_0);
    
    while (1)
    {
        // Включаем светодиод (устанавливаем PC13 в 1)
        *(uint32_t*)((uint32_t)GPIOC + 0x18) = GPIO_BSRR_BS_13;
        // Задержка
        for (volatile uint32_t i = 0; i < 1000000; i++);

        // Выключаем светодиод (сбрасываем PC13 в 0)
        *(uint32_t*)((uint32_t)GPIOC + 0x18) = GPIO_BSRR_BR_13;
        // Задержка
        for (volatile uint32_t i = 0; i < 1000000; i++);

        // Включаем светодиод (устанавливаем PC13 в 1)
        *(uint32_t*)((uint32_t)GPIOC + 0x18) = GPIO_BSRR_BS_13;
        // Задержка
        for (volatile uint32_t i = 0; i < 1000000; i++);
        
        // Выключаем светодиод (сбрасываем PC13 в 0)
        *(uint32_t*)((uint32_t)GPIOC + 0x18) = GPIO_BSRR_BR_13;
        // Задержка
        for (volatile uint32_t i = 0; i < 1000000; i++);
        
        
        // Включаем светодиод (устанавливаем PC13 в 1)
        *(uint32_t*)((uint32_t)GPIOC + 0x18) = GPIO_BSRR_BS_13;
        // Задержка
        for (volatile uint32_t i = 0; i < 9000000; i++);

        //button_to_led(&button_state);
    }
}

void SysTick_Init(uint32_t ticks)
{
    // SystemCoreClock / 1000 — the number of ticks for 1 ms
    // The LOAD controller determines the period
    // If we passed 1000 as the "desired interrupt frequency in Hz"
    // then we need to divide the system frequency by this number
    if(ticks == 1000) {
        SysTick->LOAD = (SystemCoreClock / 1000) - 1;
    } else {
        // Otherwise, we consider that the finished processor frequency has been transferred
        SysTick->LOAD = (ticks / 1000) - 1;
    }
    
    // Reset current value
    SysTick->VAL = 0;
    
    // Control register settings:
    // BIT 2: CLKSOURCE = 1 (processor frequency)
    // BIT 1: TICKINT = 1 (enable interrupt)
    // BIT 0: ENABLE = 1 (start timer)
    SysTick->CTRL = SysTick_CTRL_CLKSOURCE_Msk | 
                    SysTick_CTRL_TICKINT_Msk   | 
                    SysTick_CTRL_ENABLE_Msk;
}

void delay_ms(uint32_t ms)
{
    timing_delay_count = ms;
    while (timing_delay_count != 0);
}

void SysTick_Handler(void)
{
    if (timing_delay_count != 0x00) {
        timing_delay_count--;
    }
}

/// --- Вариант 1: Максимальная скорость (48 МГц) ---
uint8_t ClockInitHSI48MHz(void)
{
    /*
    HSI - it's already enabled after reset.
    Set the PLL parameters in RCC->CFGR
    enable PLL in RCC->CR
    wait for PLL stabiized
    set Flash wait states
    Switch to PLL clock
    https://community.st.com/t5/stm32-mcus-products/configure-system-clock-using-registers-for-stm32f030k6t6/td-p/132791
    */
    // 1. Enable HSI oscillator and wait for it to be ready
    uint32_t timeout = 0xFFFF;
    RCC->CR |= RCC_CR_HSION;
    while ((RCC->CR & RCC_CR_HSIRDY) == 0){
        if(timeout == 0) return 0;
        --timeout;
    }


    // 4. FLASH CONFIGURATION (Critically Important!)
    // Set Wait State to 1 and enable Prefetch
    FLASH->ACR = FLASH_ACR_LATENCY | FLASH_ACR_PRFTBE;


    // 2. Configure PLL
    // Перед настройкой PLL должен быть выключен
    if (RCC->CR & RCC_CR_PLLON) {
        RCC->CR &= ~RCC_CR_PLLON;
        while (RCC->CR & RCC_CR_PLLRDY);
    }
    // Источник PLL = HSI/2 (4МГц). Множитель = 12. Итого 48МГц.
    RCC->CFGR &= ~RCC_CFGR_PLLSRC; // Clear PLL source
    RCC->CFGR |= RCC_CFGR_PLLSRC_HSI_DIV2; // Set PLL source to HSI/2
    
    RCC->CFGR &= ~RCC_CFGR_PLLMUL; // Clear PLL multiplication factor
    RCC->CFGR |= RCC_CFGR_PLLMUL12; // Set PLL multiplication factor to 12


    // 3. Enable PLL
    RCC->CR |= RCC_CR_PLLON;
    timeout = 0xFFFF;
    while ((RCC->CR & RCC_CR_PLLRDY) == 0)
    {
        if(timeout == 0) return 0;
        --timeout;
    }


    // 5. Configure AHB and APB1 prescalers (AHB = 48MHz, APB = 48MHz)
    RCC->CFGR &= ~RCC_CFGR_HPRE; // Clear AHB prescaler
    RCC->CFGR |= RCC_CFGR_HPRE_DIV1; // Set AHB prescaler to 1
    
    RCC->CFGR &= ~RCC_CFGR_PPRE; // Clear APB1 prescaler
    RCC->CFGR |= RCC_CFGR_PPRE_DIV1; // Set APB1 prescaler to 1


    // 6. Select the PLL as the system clock source and wait for it to be switched
    RCC->CFGR &= ~RCC_CFGR_SW; // Clear SW bits
    RCC->CFGR |= RCC_CFGR_SW_PLL; // Set SW to PLL
    while ((RCC->CFGR & RCC_CFGR_SWS) != RCC_CFGR_SWS_PLL);


    // 7. Конфигурация тактирования периферии (после переключения на PLL)
    
    // Явно указываем USART1 использовать системную частоту (48МГц)
    RCC->CFGR3 &= ~RCC_CFGR3_USART1SW; // Clear USART1 clock source
    RCC->CFGR3 |= RCC_CFGR3_USART1SW_SYSCLK; // Set USART1 clock source to PCLK
    
    // Явно указываем I2C1 использовать системную частоту (48МГц)
    // Это ОБЯЗАТЕЛЬНО для тайминга 0x10805E89
    RCC->CFGR3 &= ~RCC_CFGR3_I2C1SW; // Clear I2C1 clock source
    RCC->CFGR3 |= RCC_CFGR3_I2C1SW_SYSCLK; // Set I2C1 clock source to HSI


    // Enable SYSCFG clock
    RCC->APB2ENR |= RCC_APB2ENR_SYSCFGEN;


