aemeltsev/STM32F0-FreeRTOS-CMSIS/src/main.c
    /*
    // Для I2C1 крайне рекомендую использовать SYSCLK (48MHz) 
    // Это позволит точнее настроить тайминги 100/400 кГц
    RCC->CFGR3 = (RCC->CFGR3 & ~RCC_CFGR3_I2C1SW) | RCC_CFGR3_I2C1SW_SYSCLK;
    */


    // 8. Обновляем SystemCoreClock (стандартный способ CMSIS)
    SystemCoreClockUpdate(); 
    return 1; // Успех
}


}// --- Вариант 1: Максимальная скорость (48 МГц) ---
uint8_t ClockInitHSI48MHz(void)
{
    /*
    HSI - it's already enabled after reset.
    Set the PLL parameters in RCC->CFGR
    enable PLL in RCC->CR
    wait for PLL stabiized
    set Flash wait states
    Switch to PLL clock
    https://community.st.com/t5/stm32-mcus-products/configure-system-clock-using-registers-for-stm32f030k6t6/td-p/132791
    */
    // 1. Enable HSI oscillator and wait for it to be ready
    uint32_t timeout = 0xFFFF;
    RCC->CR |= RCC_CR_HSION;
    while ((RCC->CR & RCC_CR_HSIRDY) == 0){
        if(timeout == 0) return 0;
        --timeout;
    }


    // 4. FLASH CONFIGURATION (Critically Important!)
    // Set Wait State to 1 and enable Prefetch
    FLASH->ACR = FLASH_ACR_LATENCY | FLASH_ACR_PRFTBE;


    // 2. Configure PLL
    // Перед настройкой PLL должен быть выключен
    if (RCC->CR & RCC_CR_PLLON) {
        RCC->CR &= ~RCC_CR_PLLON;
        while (RCC->CR & RCC_CR_PLLRDY);
    }
    // Источник PLL = HSI/2 (4МГц). Множитель = 12. Итого 48МГц.
    RCC->CFGR &= ~RCC_CFGR_PLLSRC; // Clear PLL source
    RCC->CFGR |= RCC_CFGR_PLLSRC_HSI_DIV2; // Set PLL source to HSI/2
    
    RCC->CFGR &= ~RCC_CFGR_PLLMUL; // Clear PLL multiplication factor
    RCC->CFGR |= RCC_CFGR_PLLMUL12; // Set PLL multiplication factor to 12


    // 3. Enable PLL
    RCC->CR |= RCC_CR_PLLON;
    timeout = 0xFFFF;
    while ((RCC->CR & RCC_CR_PLLRDY) == 0)
    {
        if(timeout == 0) return 0;
        --timeout;
    }


    // 5. Configure AHB and APB1 prescalers (AHB = 48MHz, APB = 48MHz)
    RCC->CFGR &= ~RCC_CFGR_HPRE; // Clear AHB prescaler
    RCC->CFGR |= RCC_CFGR_HPRE_DIV1; // Set AHB prescaler to 1
    
    RCC->CFGR &= ~RCC_CFGR_PPRE; // Clear APB1 prescaler
    RCC->CFGR |= RCC_CFGR_PPRE_DIV1; // Set APB1 prescaler to 1


    // 6. Select the PLL as the system clock source and wait for it to be switched
    RCC->CFGR &= ~RCC_CFGR_SW; // Clear SW bits
    RCC->CFGR |= RCC_CFGR_SW_PLL; // Set SW to PLL
    while ((RCC->CFGR & RCC_CFGR_SWS) != RCC_CFGR_SWS_PLL);


    // 7. Конфигурация тактирования периферии (после переключения на PLL)
    
    // Явно указываем USART1 использовать системную частоту (48МГц)
    RCC->CFGR3 &= ~RCC_CFGR3_USART1SW; // Clear USART1 clock source
    RCC->CFGR3 |= RCC_CFGR3_USART1SW_SYSCLK; // Set USART1 clock source to PCLK
    
    // Явно указываем I2C1 использовать системную частоту (48МГц)
    // Это ОБЯЗАТЕЛЬНО для тайминга 0x10805E89
    RCC->CFGR3 &= ~RCC_CFGR3_I2C1SW; // Clear I2C1 clock source
    RCC->CFGR3 |= RCC_CFGR3_I2C1SW_SYSCLK; // Set I2C1 clock source to HSI


    // Enable SYSCFG clock
    RCC->APB2ENR |= RCC_APB2ENR_SYSCFGEN;


    /*
    // Для I2C1 крайне рекомендую использовать SYSCLK (48MHz) 
    // Это позволит точнее настроить тайминги 100/400 кГц
    RCC->CFGR3 = (RCC->CFGR3 & ~RCC_CFGR3_I2C1SW) | RCC_CFGR3_I2C1SW_SYSCLK;
    */


    // 8. Обновляем SystemCoreClock (стандартный способ CMSIS)
    SystemCoreClockUpdate(); 
    return 1; // Успех
}



// --- Variand Two: Medium speed (24 MHz) from internal oscillator ---
uint8_t ClockInitHSI24MHz(void)
{
    uint32_t timeout = 0xFFFF;

    // 1. Enable HSI oscillator and wait for it to be ready
    RCC->CR |= RCC_CR_HSION;
    while (((RCC->CR & RCC_CR_HSIRDY) == 0) && --timeout);
    if (timeout == 0) return 0; // Error: HSI does not running

    // 2. Configure Flash: 0 wait state (up to 24 MHz permissible), enable Prefetch
    FLASH->ACR |= FLASH_ACR_PRFTBE;
    FLASH->ACR &= ~FLASH_ACR_LATENCY; 

    // 3. Configure PLL - Enable PLL before configure (IMPORTANT!)
    if (RCC->CR & RCC_CR_PLLON) {
        RCC->CR &= ~RCC_CR_PLLON;
        while (RCC->CR & RCC_CR_PLLRDY); // Wait for full stop
    }
    
    // 5. Configure PLL - Source PLL = HSI/2 (4MHz). Multiplier = 6. Total 24MHz.
    RCC->CFGR &= ~RCC_CFGR_PLLSRC; // Clear PLL source
    RCC->CFGR |= RCC_CFGR_PLLSRC_HSI_DIV2; // Set PLL source to HSI/2
    
    RCC->CFGR &= ~RCC_CFGR_PLLMUL; // Clear PLL multiplication factor
    RCC->CFGR |= RCC_CFGR_PLLMUL6; // Set PLL multiplication factor to 6
    
    // 6. Disable PULL and wait for stabilise
    RCC->CR |= RCC_CR_PLLON;
    timeout = 0xFFFF;
    while (!(RCC->CR & RCC_CR_PLLRDY) && --timeout);
    if (timeout == 0) return 0;

    // 5. Switch system (SW) on PLL source
    RCC->CFGR = (RCC->CFGR & ~RCC_CFGR_SW) | RCC_CFGR_SW_PLL;
    while ((RCC->CFGR & RCC_CFGR_SWS) != RCC_CFGR_SWS_PLL);

    // 6. Update global frequency variable
    SystemCoreClockUpdate();
    return 1; // Success
}

// --- Variant Three: Economic mode (8 MHz without PLL) ---
uint8_t ClockInitHSI8MHz(void)
{
    uint32_t timeout = 0xFFFF;

    // 1. Enable HSI oscillator and wait for it to be ready
    RCC->CR |= RCC_CR_HSION;
    while (((RCC->CR & RCC_CR_HSIRDY) == 0) && --timeout);
    if (timeout == 0) return 0; // Error: HSI is not running
    
    // 2. Reset the AHB and APB1 bus prescalers to their default state (divider 1)
    // This ensures that the peripherals don't operate at the "tails" of the old settings.
    RCC->CFGR &= ~(RCC_CFGR_HPRE | RCC_CFGR_PPRE);

    // 3. Configure Flash: for 8 MHz enough Latency 0
    // But it's important to reset the buffer (Prefetch), if it turn on before
    FLASH->ACR &= ~(FLASH_ACR_LATENCY | FLASH_ACR_PRFTBE);

    // 4. Switch to HSI straight
    RCC->CFGR &= ~RCC_CFGR_SW;
    while((RCC->CFGR & RCC_CFGR_SWS) != RCC_CFGR_SWS_HSI);
    
    // 5. Disable PLL for power economy
    RCC->CR &= ~RCC_CR_PLLON; 

    // 6. Update SystemCoreClock value (CMSIS standard method)
    SystemCoreClockUpdate(); 
    return 1; // Success
}

// --- Variant Four: HSE -> PLL -> 48 MHz (Quartz for 8 MHz) ---
uint8_t ClockInitHSE48MHz(void)
{
    uint32_t timeout;

    // 1. Enable HSE and wait for it to be ready
    RCC->CR |= RCC_CR_HSEON;
    // We are waiting for a successful launch or the end of the timeout
    for (timeout = 0; ; timeout++)
    {
        // If it starts successfully, then we exit the loop.
        if (RCC->CR & RCC_CR_HSERDY){
        // Wait until HSE is stabilise
            break;
        }
        // If it doesn't start, turn off everything that turns on and return the error
        if (timeout > 0x1000){
            RCC->CR &= ~(RCC_CR_HSEON); // Stop HSE
            return 1;
        }
    }

    // 2. Flash Configuration (1 wait state for 48 MHz)
    // Configuring the flash memory access frequency
    FLASH->ACR &= ~FLASH_ACR_LATENCY; // Reset of LATENCY bits
    FLASH->ACR = FLASH_ACR_LATENCY | FLASH_ACR_PRFTBE;

    // 3. Configure PLL
    // Enable PLL before change parameters (just in case)
    RCC->CR &= ~RCC_CR_PLLON;
    while(RCC->CR & RCC_CR_PLLRDY);

    // Clear the source, prescaler (PREDIV), and multiplier bits
    RCC->CFGR &= ~(RCC_CFGR_PLLSRC | RCC_CFGR_PLLMUL);
    
    // Source of PLL = HSE (through PREDIV)
    RCC->CFGR |= RCC_CFGR_PLLSRC_HSE_PREDIV; 
    
    // We make sure that PREDIV is equal to 1 (i.e. the 8 MHz input is not taken into account)
    RCC->CFGR2 &= ~RCC_CFGR2_PREDIV;
    RCC->CFGR2 |= RCC_CFGR2_PREDIV_DIV1;

    // Multiplier x6 (8 MHz * 6 = 48 MHz)
    RCC->CFGR |= RCC_CFGR_PLLMUL6;

