aemeltsev/STM32F0-FreeRTOS-CMSIS/src/main.c
    // 4. Enable PLL and wait for a stabilise
    RCC->CR |= RCC_CR_PLLON;
    // Wait for a success run or end of time out
    for(timeout=0; ; timeout++)
    {
        // If it starts successfully, then we exit the loop.
        if (RCC->CR & RCC_CR_PLLRDY) {
            // Wait until PLL is stabilise
            break;
        }
        
        // If for some reason the PLL does not start, then we turn off everything that was turned on and return an error
        if(timeout > 0x1000)
        {
            RCC->CR &= ~(RCC_CR_HSEON); // Stop HSE
            RCC->CR &= ~(RCC_CR_PLLON); // Stop PLL
            return 2;
        }
    }

    // 5. Configure a bus divisor (AHB=1, APB=1)
    RCC->CFGR &= ~(RCC_CFGR_HPRE | RCC_CFGR_PPRE);
    RCC->CFGR |= (RCC_CFGR_HPRE_DIV1 | RCC_CFGR_PPRE_DIV1);

    // 6. Switching the system to PLL
    RCC->CFGR &= ~RCC_CFGR_SW;
    RCC->CFGR |= RCC_CFGR_SW_PLL;
    timeout=0;
    while (((RCC->CFGR & RCC_CFGR_SWS) != RCC_CFGR_SWS_PLL) && timeout < 0xFFFF) {
        timeout++;
    }

    // 7. Update SystemCoreClock value (CMSIS standard method)
    SystemCoreClockUpdate();
    
    return 0; // Success
}

// --- Variant Five: HSE -> PLL -> 32 MHz (Quartz for 8 MHz) ---
uint8_t ClockInitHSE32MHz(void)
{
    uint32_t timeout = 0xFFFF;

    // 1. Turn on HSE (required, as it is the source for PLL)
    RCC->CR |= RCC_CR_HSEON;
    while (!(RCC->CR & RCC_CR_HSERDY) && --timeout);
    if (timeout == 0) return 1;

    // 2. Flash Configuration (1 wait state for 32 MHz)
    // Configuring the flash memory access frequency
    FLASH->ACR &= ~FLASH_ACR_LATENCY; // Reset of LATENCY bits
    FLASH->ACR = FLASH_ACR_LATENCY | FLASH_ACR_PRFTBE;

    // 3. PLL setup: Source HSE, PREDIV /1, MUL x4 (8 * 4 = 32)
    // PLL must be disabled before setup
    RCC->CR &= ~RCC_CR_PLLON;
    while(RCC->CR & RCC_CR_PLLRDY);
    
    // Clean the source prescaler (PREDIV) and multiplier bits
    RCC->CFGR &= ~(RCC_CFGR_PLLSRC | RCC_CFGR_PLLMUL);

    // Source is PLL = HSE (through PREDIV)
    RCC->CFGR |= RCC_CFGR_PLLSRC_HSE_PREDIV; 
    
    // We make sure, that PREDIV is equal 1 (i.e. input 8 MHz is not divisible)
    RCC->CFGR2 &= ~RCC_CFGR2_PREDIV;
    RCC->CFGR2 |= RCC_CFGR2_PREDIV_DIV1;

    // Multiplier is x6 (8 MHz * 4 = 32 MHz)
    RCC->CFGR |= RCC_CFGR_PLLMUL4;

    // 4. Enable PLL and wait for a stabilise
    RCC->CR |= RCC_CR_PLLON;
    timeout = 0xFFFF;
    while (!(RCC->CR & RCC_CR_PLLRDY) && --timeout);
    if (timeout == 0) return 2;

    // 5. Switching the system to PLL
    RCC->CFGR = (RCC->CFGR & ~RCC_CFGR_SW) | RCC_CFGR_SW_PLL;
    while ((RCC->CFGR & RCC_CFGR_SWS) != RCC_CFGR_SWS_PLL);

    // 6. Update SystemCoreClock value
    SystemCoreClockUpdate();
    
    return 0; // Success
}

// --- Variant Six: Straight HSE 8 MHz (Without PLL) ---
uint8_t ClockInitHSE8MHz(void)
{
    uint32_t timeout = 0xFFFF;

    // 1. Turn on HSE (required, as it is the source for PLL)
    RCC->CR |= RCC_CR_HSEON;
    while (!(RCC->CR & RCC_CR_HSERDY) && --timeout);
    if (timeout == 0) return 1;
    
    // 2. Flash settings: no delays are needed for 8 MHz (0 Wait State)
    // But it's useful to reset the settings to defaults
    FLASH->ACR &= ~(FLASH_ACR_LATENCY | FLASH_ACR_PRFTBE);
    
    RCC->CFGR = (RCC->CFGR & ~RCC_CFGR_SW) | RCC_CFGR_SW_HSE;

    // 5. Waiting for switch confirmation (SWS)
    timeout = 0xFFFF;
    while(((RCC->CFGR & RCC_CFGR_SWS) != RCC_CFGR_SWS_HSE) && --timeout);
    if (timeout == 0) return 2; // Error switching
    
    // 6. Disable PLL (not need for this mode saving current)
    RCC->CR &= ~RCC_CR_PLLON;
    while (RCC->CR & RCC_CR_PLLRDY); // We wait for it to stop if it was turned on.
    
    // 7. Update SystemCoreClock value (to write 8000000 value)
    SystemCoreClockUpdate();
    
    return 0; // Success
}